{
  "service": "elb",
  "controls": [
    {
      "control_id": "ELB_D8629D",
      "title": "Classic Load Balancer should span multiple Availability Zones",
      "description": "This control checks whether a Classic Load Balancer has been configured to span at least the specified number of Availability Zones (AZs). The control fails if the Classic Load Balancer does not span at least the specified number of AZs. Unless you provide a custom parameter value for the minimum number of AZs, Security Hub uses a default value of two AZs.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "ComplianceMonitoringInterrogator",
        "method": "check_monitoring",
        "parameters": {}
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.10",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_6A9576",
      "title": "Application Load Balancer should be configured with defensive or strictest desync mitigation mode",
      "description": "This control checks whether the Application Load Balancer is configured with defensive or strictest de-sync mitigation mode. This control fails if the Application Load Balancer is not configured with defensive or strictest desync mitigation mode.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "ComplianceMonitoringInterrogator",
        "method": "check_monitoring",
        "parameters": {
          "check_type": "aws_config_enabled"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.12",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_BEBE56",
      "title": "Application, Network and Gateway Load Balancers should span multiple Availability Zones",
      "description": "This control checks whether an Elastic Load Balancer V2 (Application, Network, or Gateway Load Balancer) has registered instances from at least the specified number of Availability Zones (AZs). The control fails if an Elastic Load Balancer V2 doesn't have instances registered in at least the specified number of AZs. Unless you provide a custom parameter value for the minimum number of AZs, Security Hub uses a default value of two AZs.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "ServiceConfigInterrogator",
        "method": "check_service_config",
        "parameters": {
          "check_type": "general"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.13",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_9539B1",
      "title": "Classic Load Balancer should be configured with defensive or strictest desync mitigation mode",
      "description": "This control checks whether the Classic Load Balancer is configured with defensive or strictest desync mitigation mode. This control will fail if the Classic Load Balancer is not configured with defensive or strictest desync mitigation mode.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "ComplianceMonitoringInterrogator",
        "method": "check_monitoring",
        "parameters": {
          "check_type": "aws_config_enabled"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.14",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_E54FE4",
      "title": "Application and Network Load Balancers with listeners should use recommended security policies",
      "description": "This control checks whether the HTTPS listener for an Application Load Balancer or the TLS listener for a Network Load Balancer is configured to encrypt data in transit by using a recommended security policy. The control fails if the HTTPS or TLS listener for a load balancer isn't configured to use a recommended security policy.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "EncryptionConfigInterrogator",
        "method": "check_encryption",
        "parameters": {
          "encryption_type": "both",
          "key_type": "any"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.17",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_C5A512",
      "title": "Application and Network Load Balancer listeners should use secure protocols to encrypt data in transit",
      "description": "This control checks whether the listener for an Application Load Balancer or Network Load Balancer is configured to use a secure protocol for encryption of data in transit. The control fails if an Application Load Balancer listener isn't configured to use the HTTPS protocol, or a Network Load Balancer listener isn't configured to use the TLS protocol.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "EncryptionConfigInterrogator",
        "method": "check_encryption",
        "parameters": {
          "encryption_type": "in_transit",
          "key_type": "any"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.18",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_58E22C",
      "title": "Classic Load Balancers with SSL/HTTPS listeners should use a certificate provided by AWS Certificate Manager",
      "description": "This control checks whether a Classic Load Balancer uses HTTPS/SSL certificates provided by AWS Certificate Manager. The control fails if a Classic Load Balancer that is configured with an HTTPS/SSL listener does not use a certificate provided by AWS Certificate Manager.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "EncryptionConfigInterrogator",
        "method": "check_encryption",
        "parameters": {
          "encryption_type": "both",
          "key_type": "any"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.2",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_2DE9E7",
      "title": "Classic Load Balancer listeners should be configured with HTTPS or TLS termination",
      "description": "This control checks whether your Classic Load Balancer listeners are configured with HTTPS or TLS protocol for front-end (client to load balancer) connections. The control is applicable if a Classic Load Balancer has listeners. If your Classic Load Balancer does not have a listener configured, then the control does not report any findings.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "EncryptionConfigInterrogator",
        "method": "check_encryption",
        "parameters": {
          "encryption_type": "both",
          "key_type": "any"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.3",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "AWS_FCAD56",
      "title": "Application load balancer should be configured to drop invalid http headers",
      "description": "This control evaluates AWS Application Load Balancers (ALB) to ensure they are configured to drop invalid http headers. By default, ALBs are not configured to drop invalid http header values. This control evaluates all ALBs fails if the attribute value of routing.http.drop_invalid_header_fields.enabled is set to false.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "ComplianceMonitoringInterrogator",
        "method": "check_monitoring",
        "parameters": {
          "check_type": "aws_config_enabled"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.4",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_35DE81",
      "title": "Application and Classic Load Balancers logging should be enabled",
      "description": "This control checks whether the Application Load Balancer and the Classic Load Balancer have logging enabled. The control fails if the access_logs.s3.enabled is false.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "LoggingConfigInterrogator",
        "method": "check_logging",
        "parameters": {}
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.5",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_9D5F82",
      "title": "Application, Gateway, and Network Load Balancers should have deletion protection enabled",
      "description": "This control checks whether Application, Gateway, and Network Load Balancers have deletion protection enabled. The control fails if deletion protection is disabled.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "ServiceConfigInterrogator",
        "method": "check_service_config",
        "parameters": {
          "check_type": "general"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.6",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_AF834B",
      "title": "Classic Load Balancers should have connection draining enabled",
      "description": "This control checks whether AWS Classic Load Balancers have connection draining enabled.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "ServiceConfigInterrogator",
        "method": "check_service_config",
        "parameters": {
          "check_type": "general"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.7",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_EE2C5A",
      "title": "Classic Load Balancers with SSL listeners should use a predefined security policy that has strong configuration",
      "description": "This control checks whether your Classic Load Balancer SSL listeners use the predefined policy ELBSecurityPolicy-TLS-1-2-2017-01. The control fails if the Classic Load Balancer SSL listeners do not use the predefined policy ELBSecurityPolicy-TLS-1-2-2017-01.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "EncryptionConfigInterrogator",
        "method": "check_encryption",
        "parameters": {
          "encryption_type": "both",
          "key_type": "any"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.8",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_61FC27",
      "title": "Classic Load Balancers should have cross-zone load balancing enabled",
      "description": "This control checks whether cross-zone load balancing is enabled for Classic Load Balancers. This control fails if cross-zone load balancing is not enabled for a Classic Load Balancer.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "ServiceConfigInterrogator",
        "method": "check_service_config",
        "parameters": {
          "check_type": "general"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELB.9",
          "severity": "MEDIUM"
        }
      }
    },
    {
      "control_id": "ELB_AB735F",
      "title": "Application Load Balancer should be configured to redirect all HTTP requests to HTTPS",
      "description": "This AWS control checks whether HTTP to HTTPS redirection is configured on all HTTP listeners of Application Load Balancers. The control will fail if one or more HTTP listeners of Application Load Balancers do not have HTTP to HTTPS redirection configured.",
      "severity": "MEDIUM",
      "interrogation": {
        "class": "EncryptionConfigInterrogator",
        "method": "check_encryption",
        "parameters": {
          "encryption_type": "both",
          "key_type": "any"
        }
      },
      "standards": {
        "fsbp": {
          "control_id": "ELBv2.1",
          "severity": "MEDIUM"
        }
      }
    }
  ]
}